#!/bin/bash
# ===========================================================
host=google.com
gw1="DD-WRT" # имена и IP адреса необходимо прописать в /etc/hosts
gw2="ASUS"
log="/var/log/Test_Internet.log"
# Если используется монитор conky раскоментировать строку
#Conky="/mining/.log/.testInternetConky.msg"

# =============== Сообщения для LOG файла ===================
Gateway1="Интернет $gw1"
Gateway2="Интернет $gw2"
SwitchGW1="Переключаем интернет на $gw1"
CHeckInetGW1="Проверяем доступность интернета на $gw1"
OnLine="Интернет доступен"
NoGw1SwGW2="Интернет не дотупен, переключаем на $gw2"
CHeckInetGW2="Проверяем доступность интернета на $gw2"
NoGW2="Интернет на $gw2 не доступен"
# ============================================================
